---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsRun.GetRightSupports
source: html/d28ad844-a878-5953-df59-5f7f092207ea.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.GetRightSupports Method

Retrieves all supports on the right side of run boundaries.

## Syntax (C#)
```csharp
public IList<ElementId> GetRightSupports()
```

## Returns
The supports on the right side of run boundaries.